{
    "GLOBAL_SETTINGS": {
        "language": "",
        "language ?": "Language (title from 'LOCALIZATION', default '' - auto detection)"
    },
    "LOCALIZATION": {
        "en": {                                    
            "Unable_to_determine_active_field": "Unable to determine active field.",
            "Invalid_field_index": "Invalid field index.",  
            "Invalid_field_type": "The record type must be 'Crossword' or contain 6 specified fields.\nCursor must be in one of these fields:",
            "WindowTitle": "Crossword for EclipseCrossword",
            "HelpText": "Here goes the help text...",
            "Help": "Help",
            "HelpTab": "Help",
            "WordField": "Field: 'word=transcription=translation=example=extranslation'",
            "OrderFields": "The order of the insert fields is:",
            "Clear": "Clear",
            "AddFromTxt": "Add from file TXT and convert TAB to =",
            "CreateHint1": "Create 'Word_hint' (word: translation)",
            "CreateHint2": "Create 'Word_hint' (word: example)",
            "WordTab": "Words",
            "WordHintField": "Field: 'Word_hint' (file-type ewl)",
            "SaveEWL": "Save to file *.ewl",
            "HintTab": "Word:  Hint",
            "CrosswordCode": "Field: 'Crossword_code'",
            "PasteHTML": "Paste from crossword file *.html",
            "CodeTab": "Crossword сode",
            "Warning": "Warning",
            "NoContent": "No content to save in 'Word_hint' field!",
            "SaveEWLFile": "Save Word Hint File",
            "Success": "Success",
            "FileSaved": "File saved successfully!",
            "Error": "Error",
            "SaveError": "Failed to save file: ",
            "OpenHTMLFile": "Open Crossword HTML File",
            "InvalidFile": "Invalid File",
            "NotCrosswordFile": "The selected file doesn't appear to be a crossword file (missing 'CrosswordWidth =')",
            "InvalidFormat": "Invalid Format",
            "NoEndMarker": "Could not find the end marker '//-->' in the file",
            "CodeImported": "Crossword code imported successfully!",
            "ReadError": "Failed to read file: ",   
            "OpenTXTFile": "Open Anki Export TXT File",
            "NotAnkiExport": "The selected file is not a valid Anki export (missing '#separator:tab' in first line)",
            "HTMLWarning": "HTML Warning",
            "HTMLNotAllowed": "HTML is not allowed in the export file",
            "InvalidOrder": "Invalid Order",
            "OrderFormatError": "Field order should be numbers separated by '=' (e.g. '1=2=3=4=5')",
            "ImportSuccess": "Imported from file and added lines: ",
            "ImportError": "Failed to import file: ",
            "NoContentWordField": "No content in word field!",
            "NoValidLines": "No valid lines found for creating hints",
            "SelectEncoding": "Select File Encoding",
            "ChooseEncoding": "Choose text encoding:",
            "FileSavedEncoding": "File saved successfully, encoding: ",
            "Save": "💾 Save",
            "FieldsUpdated": "All fields have been successfully updated!",
            "SaveErrorField": "Failed to save fields: ",
            "Close": "Close",                        
            "Saved": "Saved",
            "Solution_hint": "Solution hint",
            "No_solution_hint": "No solution hint",
            "Clue_array_not_found": "Clue array not found in the code!",
            "Failed_to_parse_Clue_array": "Failed to parse 'Clue' array!",
            "No_match_found_for_Clue_item": "No match found for Clue item",

            "help_str1": "This anki add-on is designed to simplify the formation of a crossword puzzle built using the free program https://www.eclipsecrossword.com/\nThe EclipseCrossword program is only for Windows, but you only need it once to generate the crossword code.",
            "help_str2": "\nIf you have a ready-made EclipseCrossword crossword puzzle saved as HTML with JavaScript, then you can immediately open the last tab and use the button to insert from the file to get the crossword code.\nAt the end of the code there is \"OnlyCheckOnce = false;\" - this means that you can check the words of the crossword many times, and not just once. The line \"Solve = false;\" says that there will be no hints. You can change \"Solve\" either manually or using the buttons.",
            "help_str3": "\nThe crossword itself is shown on the back of the card. And on the front of the card, words.\nThe tab with words can be empty if you don't want to prompt anything, but it can be in the form of a simple list of words (or prompts).",
            "help_str4": "\nIn the tab with words, you can enter not just words, but a word==translation (hint, definition).\nBy writing ==, you skip the transcription, which is not needed in a regular crossword.\nYou can click the button to create data for the third tab or enter it yourself, since the format there is not complicated:\nword: hint\n(note that there should be 2 spaces after the colon).\nYou can mix this list of words, limit it to the required number (recommended no more than 20) and then sort it in order if necessary.",
            "help_str5": "\nThe word list data can be saved to a file in the \"*.ewl\" format and opened by the EclipseCrossword program for further generation of a new crossword, saving it as a file \"*.html\" and subsequent pasting of the crossword code from this file (the button on the last tab).\n\nThe EclipseCrossword program is very old and does not yet support the UTF-8 format, so save in your encoding. If a character outside the ANSI encoding is encountered, it will be written to the \"UTF=ANSI\" field and a question mark will be placed after the equal sign. This question mark must be replaced with some temporary character that is not in the words, for example, with different digits (from 0 to 9). These temporary characters will then be replaced when you press the \"REPL ClueArray ANSI->UTF\" button and if all the replacements are correct, the algorithm will then receive a list of words \"Word\" from the tab with words using a hint. To do this, click one of the buttons to allow or prohibit hints.",
            "help_str6": "\nPlease note that in addition to the title, the record has two more fields: \"Language_SpeechSynthesis\" and \"Symbols_for_buttons\".\nUsually these fields are empty, then English is assumed and all symbols for buttons. If your words are in another language, then you need to enter a line in the \"BCP 47 language tag\" format in the \"Language_SpeechSynthesis\" field, for example, for German you need to write \"de-DE\" (without quotes, of course).\nThe \"Symbols_for_buttons\" field could be left blank, but still, if you use it in AnkiDroid, then typing is done only through buttons, simply so that keyboard hints are not used. It is not so convenient to look at a large crossword on Android, and it is difficult to remember many words at once, so limit your crossword to about 20 words.",
            "help_str7": "\nIf you have foreign language word cards with the fields: word, transcription, translation, example and translation of the example (the order of the fields is not important). Then you can select these entries in the anki program and export them to a file (.txt). Export simply as text, without all other parameters. In the tab with words there is a button with which you can add words from a text file. If the order of the fields is different, you will need to change the text field (1=2=3=4=5) before adding (or after, but clear the entire field and add it again).",
            "help_str8": "\nWhen a word has an example, you can create a list of words with an example (there is a separate button for this), but since the example should not suggest a word, this word is replaced with ***. When you pronounce a word in the crossword, the example will be pronounced after it, since it is in the same language as the word.",

            "var z_lang_front00": "Crossword",
            "var z_lang_front01": "List of words",
            "var z_lang_front02": "Show all",
            "var z_lang_front03": "Hide all",
            "var z_lang_front04": "Speech synthesis",
            "var z_lang_front05": "Show only 1",
            "var z_lang_front1": "Help",
            "var z_lang_front2": "We memorize 5 words until we can easily recall them (usually we need to go through these words 3 times in a circle). ",
            "var z_lang_front3": "These 5 words (lines) are separated by a line.",
            "var z_lang_front4": "Before showing a word (a sentence of words), we need to visually recall each letter (drawing in our imagination letter by letter that we are writing or typing it on the screen), remember how the word is pronounced. After the word is voiced (if \"Speech synthesis\" is enabled when showing a word or sentence), we need to say this word to ourselves two or three more times.",
            "var z_lang_front5": "The \"Show all\" button is designed to show all blocks (in []). It is useful if you need to quickly recall and do not need to study.",
            "var z_lang_front6": "The \"Hide all\" button is designed to hide all blocks in order to then proceed to the memorization process.",
            "var z_lang_front7": "You can click on the field with the \"Show only 1\" flag (set) and then, before showing the desired block, all the others will be hidden. This helps to concentrate better on one block and it is useful, because before opening another block, you should try to remember what is there, and this helps to memorize.",
            "var z_lang_front8": "The field with the \"Speech synthesis\" checkbox can be disabled if you do not like the synthesized voice (depending on the system settings). ",
            "var z_lang_front9": "This functionality of hiding and opening blocks allows you to organize the desired order of memorization: open a word and remember the translation or vice versa, open the translation and remember the word.",
            "var z_lang_front10": "You are not limited in the sequence of memorizing words, but it is still advisable to memorize about 5 words well before moving on to memorizing the other 5 words.",
            "var z_lang_back1": "This interactive crossword puzzle requires JavaScript and any recent web browser, including Windows Internet Explorer, Mozilla Firefox, Google Chrome, or Apple Safari.  If you have disabled web page scripting, please re-enable it and refresh the page.  If this web page is saved on your computer, you may need to click the yellow Information Bar at the top or bottom of the page to allow the puzzle to load.",
            "var z_lang_back2": "Congratulations!",
            "var z_lang_back3": "You have completed this crossword puzzle",
            "var z_lang_back4": "Welcome!",
            "var z_lang_back5": "Click a word in the puzzle to get started.",
            "var z_lang_back6": "Solve",
            "var z_lang_back7": "OK",
            "var z_lang_back8": "Cancel",
            "var z_lang_back9": "Check puzzle",
            "var z_lang_back10": "Please wait while the crossword is loaded...",
            "var z_lang_back11": "Across, letters",
            "var z_lang_back12": "Down, letters",
            "var z_lang_back13": "The word that you typed contains invalid characters. Please type only letters in the box above.",
            "var z_lang_back14": "You did not type enough letters. Total letters in this word",
            "var z_lang_back15": "You typed too many letters. Total letters in this word",
            "var z_lang_back16": "Errors",
            "var z_lang_back17": "Incomplete words",
            "var z_lang_back18": "Finish",
            "var z_lang_back19" : "Words suggested"
        },
        "ru": {        
            "Unable_to_determine_active_field": "Не удалось определить активное поле.",
            "Invalid_field_index": "Недопустимый индекс поля.",  
            "Invalid_field_type": "Тип записи должен быть 'Crossword' или содержать 6 указанных полей.\nКурсор должен находиться в одном из этих полей:",
            "WindowTitle": "Crossword for EclipseCrossword",
            "HelpText": "Здесь должен быть текст справки...",
            "Help": "Справка",
            "HelpTab": "Справка",
            "WordField": "Поле: 'word=transcription=translation=example=extranslation'",
            "OrderFields": "Порядок полей для вставки:",
            "Clear": "Очистить",
            "AddFromTxt": "Добавить из TXT-файла и конвертировать TAB в =",
            "CreateHint1": "Создать 'Word_hint' (слово: перевод)",
            "CreateHint2": "Создать 'Word_hint' (слово: пример)",
            "WordTab": "Слова",
            "WordHintField": "Поле: 'Word_hint' (тип файла ewl)",
            "SaveEWL": "Сохранить в файл *.ewl",
            "HintTab": "Слово: Подсказка",
            "CrosswordCode": "Поле: 'Crossword_code'",
            "PasteHTML": "Вставить из файла кроссворда *.html",
            "CodeTab": "Код кроссворда",
            "Warning": "Предупреждение",
            "NoContent": "Нет содержимого для сохранения в поле 'Word_hint'!",
            "SaveEWLFile": "Сохранить файл подсказок",
            "Success": "Успешно",
            "FileSaved": "Файл успешно сохранён!",
            "Error": "Ошибка",
            "SaveError": "Ошибка сохранения файла: ",
            "OpenHTMLFile": "Открыть HTML-файл кроссворда",
            "InvalidFile": "Неверный файл",
            "NotCrosswordFile": "Выбранный файл не является файлом кроссворда (отсутствует 'CrosswordWidth =')",
            "InvalidFormat": "Неверный формат",
            "NoEndMarker": "Не удалось найти конечный маркер '//-->' в файле",
            "CodeImported": "Код кроссворда успешно импортирован!",
            "ReadError": "Ошибка чтения файла: ",   
            "OpenTXTFile": "Открыть экспортированный TXT-файл Anki",
            "NotAnkiExport": "Выбранный файл не является корректным экспортом Anki (отсутствует '#separator:tab' в первой строке)",
            "HTMLWarning": "Предупреждение HTML",
            "HTMLNotAllowed": "HTML не допускается в экспортируемом файле",
            "InvalidOrder": "Неверный порядок",
            "OrderFormatError": "Порядок полей должен быть указан числами, разделёнными '=' (например '1=2=3=4=5')",
            "ImportSuccess": "Импортировано из файла и добавлено строк: ",
            "ImportError": "Ошибка импорта файла: ",
            "NoContentWordField": "Нет содержимого в поле слова!",
            "NoValidLines": "Не найдено подходящих строк для создания подсказок",
            "SelectEncoding": "Выберите кодировку файла",
            "ChooseEncoding": "Выберите кодировку текста:",
            "FileSavedEncoding": "Файл успешно сохранён, кодировка: ",
            "Save": "💾 Сохранить",
            "FieldsUpdated": "Все поля успешно обновлены!",
            "SaveErrorField": "Ошибка сохранения полей: ",
            "Close": "Закрыть",
            "Saved": "Сохранено",
            "Solution_hint": "Подсказка слова",
            "No_solution_hint": "Без подсказок",
            "Clue_array_not_found": "Массив Clue не найден в коде!",
            "Failed_to_parse_Clue_array": "Не удалось разобрать массив Clue!",
            "No_match_found_for_Clue_item": "Совпадение для элемента Clue не найдено",

            "help_str1": "Это дополнение anki служит для упрощения формирования кроссворда построенного с помощью бесплатной программы https://www.eclipsecrossword.com/\nПрограмма EclipseCrossword только для виндовс, но вам она нужна только один раз для генерации кода кроссворда.",
            "help_str2": "\nЕсли у вас есть готовый кроссворд EclipseCrossword сохраненный как HTML с JavaScript, то вы можете сразу открыть последнюю вкладку и используя кнопку для вставки из файла получить код кроссворда.\nВ конце кода есть «OnlyCheckOnce = false;» - это значит, что можно много раз проверять слова кроссворда, а не однократно. Строка «Solve = false;» говорит, что подсказок не будет. Можно изменить «Solve» или вручную или же с помощью кнопок.",
            "help_str3": "\nСам кроссворд показывается на обратной стороне карты. А на лицевой стороне карты могут показываться слова.\nВкладка со словами может быть и пустой, если вы не хотите ничего подсказывать, но может быть в виде простого списка слов (или подсказок).",
            "help_str4": "\nВо вкладке со словами вы можете вводить не просто слова, а слово==перевод (подсказка, определение).\nНаписав == вы пропускаете транскрипцию, которая в обычном кроссворде и не нужна.\nВы можете нажать кнопку создания данных для третьей вкладки или же ввести самому, так как формат там не сложный:\nслово:  подсказка\n(обратите внимание, что после двоеточия должно быть 2 пробела).\nЭтот список слов вы можете перемешать, ограничить нужным количеством (рекомендуется не больше 20) и потом отсортировать по порядку если необходимо.",
            "help_str5": "\nДанные списка слов можно сохранить в файл формата «*.ewl» и открывать программой EclipseCrossword для дальнейшей генерации нового кроссворда, сохранения его как файл «*.html» и последующей вставки кода кроссворда из этого файла (кнопка на последней вкладке).\n\nПрограмма EclipseCrossword очень старая и пока не поддерживает формат UTF-8, так что сохраняйте в вашей кодировке. В случае, если будет встречен символ вне ANSI кодировке, то он запишется в поле «UTF=ANSI» и после знака равно будет поставлен знак вопроса. Этот знак вопроса надо заменить на какой-то временный символ которого нет в словах, допустим на разные знаки цифр (от 0 до 9). Эти временные символы потом будут замены когда нажмете кнопку «REPL ClueArray ANSI->UTF» и если все замены пройдут верно, то алгоритм потом по подсказке получит список слов «Word» из вкладки со словами. Для этого надо нажать на одну из кнопок разрешения или запрета подсказок.",
            "help_str6": "\nОбратите внимание, что в записи кроме заголовка есть еще два поля: «Language_SpeechSynthesis» и «Symbols_for_buttons».\nОбычно эти поля пустые, тогда предполагается английский язык и все символы для кнопок. Если же слова у вас на другом языке, то надо в поле «Language_SpeechSynthesis» вписать строку в формате «BCP 47 language tag», например для немецкого надо написать «de-DE» (без кавычек конечно).\nПоле «Symbols_for_buttons» можно было бы и не заполнять, но все же если вы будете использовать в AnkiDroid, то там сделан набор только через кнопки, просто от того, чтобы не использовали подсказки клавиатуры. В андроиде не так удобно глядеть большой кроссворд, да и запоминать сложно сразу много слов, так что ограничивайте ваш кроссворд где-то 20 словами.",
            "help_str7": "\nЕсли у вас есть карточки слов иностранного языка с полями: слово, транскрипция, перевод, пример и перевод примера (порядок полей не важен). То вы можете выделить эти записи в программе anki и экспортировать их в файл (.txt). Экспортируйте просто как текст, без всех других параметров. Во вкладке со словами есть кнопка, с помощью которой вы можете добавить слова из текстового файла. Если порядок полей будет другой, то надо будет изменить текстовое поле (1=2=3=4=5) перед добавлением (или после, но очистить все поле и заново добавить).",
            "help_str8": "\nКогда у слова есть пример, то можно создать список слов с примером (для этого есть отдельная кнопка), но так как пример не должен подсказывать слово, то это слово заменяется на ***. Когда вы в кроссворде озвучите слово, то после него будет озвучен и пример, так как он на том же языке, что и слово.",

            "var z_lang_front00": "Кроссворд",
            "var z_lang_front01": "Список слов",
            "var z_lang_front02": "Показать все",
            "var z_lang_front03": "Скрыть все",
            "var z_lang_front04": "Синтез речи",
            "var z_lang_front05": "Показать только 1",
            "var z_lang_front1": "Помощь",
            "var z_lang_front2": "Мы запоминаем 5 слов, пока не сможем легко их вспомнить (обычно нам нужно пройти эти слова 3 раза по кругу).",
            "var z_lang_front3": "Эти 5 слов (строк) разделены линией.",
            "var z_lang_front4": "Прежде чем показать слово (предложение из слов), нам нужно зрительно вспомнить каждую букву (рисуя в воображении букву за буквой, которую мы пишем или печатаем на экране), запоминаем, как произносится слово. После того, как слово озвучено (если включен \"Синтез речи\" при показе слова или предложения), нам нужно про себя произнести это слово еще два-три раза.",
            "var z_lang_front5": "Кнопка \"Показать все\" предназначена для показа всех блоков (в []). Полезно, если нужно быстро вспомнить и не нужно изучать.",
            "var z_lang_front6": "Кнопка \"Скрыть все\" предназначена для скрытия всех блоков, чтобы потом перейти к процессу запоминания.",
            "var z_lang_front7": "Можно нажать на поле с флажком \"Показать только 1\" (установить) и тогда, перед показом нужного блока, все остальные будут скрыты. Это помогает лучше сосредоточиться на одном блоке и полезно, так как перед тем, как открыть другой блок, надо попытаться вспомнить, что там есть, а это помогает запоминать.",
            "var z_lang_front8": "Поле с флажком \"Синтез речи\" можно отключить, если вам не нравится синтезированный голос (в зависимости от настроек системы). ",
            "var z_lang_front9": "Эта функция скрытия и открытия блоков позволяет организовать желаемый порядок запоминания: открыть слово и запомнить перевод или наоборот, открыть перевод и запомнить слово.",
            "var z_lang_front10": "Вы не ограничены в последовательности запоминания слов, но все равно желательно хорошо запомнить около 5 слов, прежде чем переходить к запоминанию остальных 5 слов.",
            "var z_lang_back1": "Для этого интерактивного кроссворда требуется JavaScript и любой современный веб-браузер, включая Windows Internet Explorer, Mozilla Firefox, Google Chrome или Apple Safari. Если вы отключили скрипты веб-страниц, включите их снова и обновите страницу. Если эта веб-страница сохранена на вашем компьютере, вам может потребоваться нажать на желтую информационную панель вверху или внизу страницы, чтобы разрешить загрузку кроссворда.",
            "var z_lang_back2": "Поздравляем!",
            "var z_lang_back3": "Вы завершили этот кроссворд",
            "var z_lang_back4": "Добро пожаловать!",
            "var z_lang_back5": "Нажмите на слово в кроссворде, чтобы начать",
            "var z_lang_back6": "Решить",
            "var z_lang_back7": "ОК",
            "var z_lang_back8": "Отмена",
            "var z_lang_back9": "Проверить кроссворд",
            "var z_lang_back10": "Пожалуйста, подождите, пока загрузится кроссворд...",
            "var z_lang_back11": "По горизонтали, букв",
            "var z_lang_back12": "По вертикали, букв",
            "var z_lang_back13": "Введенное вами слово содержит недопустимые символы. Введите только буквы в поле выше",
            "var z_lang_back14": "Вы ввели недостаточно букв. Всего букв в этом слове",
            "var z_lang_back15": "Вы ввели слишком много букв. Всего букв в этом слове",
            "var z_lang_back16": "Ошибки",
            "var z_lang_back17": "Неполные слова",
            "var z_lang_back18": "Завершить",
            "var z_lang_back19": "Подсказано слов"
        },       
        "de": {
            "Unable_to_determine_active_field": "Aktives Feld konnte nicht bestimmt werden.",
            "Invalid_field_index": "Ungültiger Feldindex.",  
            "Invalid_field_type": "Der Datensatztyp muss 'Crossword' sein oder 6 spezifizierte Felder enthalten.\nDer Cursor muss in einem dieser Felder sein:",
            "WindowTitle": "Crossword for EclipseCrossword",
            "HelpText": "Hier kommt der Hilfetext...",
            "Help": "Hilfe",
            "HelpTab": "Hilfe",
            "WordField": "Feld: 'word=transcription=translation=example=extranslation'",
            "OrderFields": "Die Reihenfolge der Eingabefelder ist:",
            "Clear": "Löschen",
            "AddFromTxt": "Aus TXT-Datei hinzufügen und TAB in = konvertieren",
            "CreateHint1": "'Word_hint' erstellen (Wort: Übersetzung)",
            "CreateHint2": "'Word_hint' erstellen (Wort: Beispiel)",
            "WordTab": "Wörter",
            "WordHintField": "Feld: 'Word_hint' (Dateityp ewl)",
            "SaveEWL": "In Datei *.ewl speichern",
            "HintTab": "Wort: Hinweis",
            "CrosswordCode": "Feld: 'Crossword_code'",
            "PasteHTML": "Aus Kreuzworträtsel-Datei *.html einfügen",
            "CodeTab": "Kreuzworträtsel-Code",
            "Warning": "Warnung",
            "NoContent": "Kein Inhalt zum Speichern im 'Word_hint'-Feld!",
            "SaveEWLFile": "Wort-Hinweis-Datei speichern",
            "Success": "Erfolg",
            "FileSaved": "Datei erfolgreich gespeichert!",
            "Error": "Fehler",
            "SaveError": "Fehler beim Speichern der Datei: ",
            "OpenHTMLFile": "Kreuzworträtsel-HTML-Datei öffnen",
            "InvalidFile": "Ungültige Datei",
            "NotCrosswordFile": "Die ausgewählte Datei scheint keine Kreuzworträtsel-Datei zu sein (fehlend 'CrosswordWidth =')",
            "InvalidFormat": "Ungültiges Format",
            "NoEndMarker": "Endmarkierung '//-->' in der Datei nicht gefunden",
            "CodeImported": "Kreuzworträtsel-Code erfolgreich importiert!",
            "ReadError": "Fehler beim Lesen der Datei: ",   
            "OpenTXTFile": "Anki-Export-TXT-Datei öffnen",
            "NotAnkiExport": "Die ausgewählte Datei ist kein gültiger Anki-Export (fehlend '#separator:tab' in der ersten Zeile)",
            "HTMLWarning": "HTML-Warnung",
            "HTMLNotAllowed": "HTML ist in der Exportdatei nicht erlaubt",
            "InvalidOrder": "Ungültige Reihenfolge",
            "OrderFormatError": "Feldreihenfolge sollte durch '=' getrennte Zahlen sein (z.B. '1=2=3=4=5')",
            "ImportSuccess": "Aus Datei importiert und Zeilen hinzugefügt: ",
            "ImportError": "Fehler beim Importieren der Datei: ",
            "NoContentWordField": "Kein Inhalt im Wortfeld!",
            "NoValidLines": "Keine gültigen Zeilen zum Erstellen von Hinweisen gefunden",
            "SelectEncoding": "Dateikodierung auswählen",
            "ChooseEncoding": "Textkodierung wählen:",
            "FileSavedEncoding": "Datei erfolgreich gespeichert, Kodierung: ",
            "Save": "💾 Speichern",
            "FieldsUpdated": "Alle Felder wurden erfolgreich aktualisiert!",
            "SaveErrorField": "Fehler beim Speichern der Felder: ",
            "Close": "Schließen",
            "Saved": "Gespeichert",
            "Solution_hint": "Lösungshinweis",
            "No_solution_hint": "Kein Lösungshinweis",
            "Clue_array_not_found": "Clue-Array im Code nicht gefunden!",
            "Failed_to_parse_Clue_array": "Konnte Clue-Array nicht analysieren!",
            "No_match_found_for_Clue_item": "Keine Übereinstimmung für Clue-Element gefunden",

            "help_str1": "Dieses Anki-Add-on vereinfacht die Erstellung von Kreuzworträtseln mit dem kostenlosen Programm https://www.eclipsecrossword.com/. Das Programm EclipseCrossword ist nur für Windows verfügbar, wird aber nur einmal benötigt, um den Kreuzworträtselcode zu generieren.",
            "help_str2": "\nWenn Sie ein fertiges EclipseCrossword-Kreuzworträtsel als HTML mit JavaScript gespeichert haben, können Sie direkt den letzten Tab öffnen und über die Schaltfläche „Aus der Datei einfügen“ den Kreuzworträtselcode abrufen. Am Ende des Codes steht „OnlyCheckOnce = false;“ – das bedeutet, dass Sie die Wörter des Kreuzworträtsels mehrmals und nicht nur einmal überprüfen können. Die Zeile „Solve = false;“ bedeutet, dass keine Hinweise angezeigt werden. Sie können „Solve“ entweder manuell oder über die Schaltflächen ändern.",
            "help_str3": "\nDas Kreuzworträtsel selbst ist auf der Rückseite der Karte abgebildet. Auf der Vorderseite der Karte steht Wörter.\nDer Reiter mit den Wörtern kann leer bleiben, wenn Sie keine Eingabeaufforderungen wünschen. Er kann aber auch in Form einer einfachen Liste von Wörtern (oder Eingabeaufforderungen) vorliegen.",
            "help_str4": "\nIm Reiter mit den Wörtern können Sie nicht nur Wörter, sondern auch eine Wort==Übersetzung (Hinweis, Definition) eingeben.\nDurch Eingabe von == überspringen Sie die Transkription, die in einem normalen Kreuzworträtsel nicht erforderlich ist.\nSie können auf die Schaltfläche klicken, um Daten für den dritten Reiter zu erstellen, oder diese selbst eingeben, da das Format dort unkompliziert ist:\nWort: Hinweis\n(Beachten Sie, dass nach dem Doppelpunkt zwei Leerzeichen stehen sollten).\nSie können diese Liste von Wörtern mischen, auf die gewünschte Anzahl begrenzen (empfohlen nicht mehr als 20) und sie dann bei Bedarf sortieren.",
            "help_str5": "\nDie Daten der Wortliste können in einer Datei im Format „*.ewl“ gespeichert und mit dem Programm EclipseCrossword zur Erstellung eines neuen Kreuzworträtsels geöffnet werden. \"*.html\" und anschließendes Einfügen des Kreuzworträtselcodes aus dieser Datei (Schaltfläche auf der letzten Registerkarte).\n\nDas Programm EclipseCrossword ist sehr alt und unterstützt das UTF-8-Format noch nicht. Speichern Sie daher in Ihrer Kodierung. Wird ein Zeichen außerhalb der ANSI-Kodierung gefunden, wird es in das Feld \"UTF=ANSI\" geschrieben und ein Fragezeichen nach dem Gleichheitszeichen gesetzt. Dieses Fragezeichen muss durch ein temporäres Zeichen ersetzt werden, das nicht in den Wörtern vorkommt, z. B. durch andere Ziffern (von 0 bis 9). Diese temporären Zeichen werden dann ersetzt, wenn Sie die Schaltfläche \"REPL ClueArray ANSI->UTF\" drücken. Wenn alle Ersetzungen korrekt sind, erhält der Algorithmus eine Liste von Wörtern \"Word\" aus der Registerkarte mit Wörtern, die einen Hinweis verwenden. Klicken Sie dazu auf eine der Schaltflächen, um Hinweise zuzulassen oder zu verbieten. \"help_str6\"\nBitte beachten Sie, dass der Datensatz neben dem Titel zwei weitere Felder: „Sprache_Sprachsynthese“ und „Symbole_für_Schaltflächen“.\nNormalerweise sind diese Felder leer, dann wird Englisch und alle Symbole für Schaltflächen angenommen. Wenn Ihre Wörter in einer anderen Sprache verfasst sind, müssen Sie im Feld „Sprache_Sprachsynthese“ eine Zeile im Format „BCP 47 Sprachtag“ eingeben, z. B. für Deutsch „de-DE“ (natürlich ohne Anführungszeichen).\nDas Feld „Symbole_für_Schaltflächen“ kann leer gelassen werden. Wenn Sie es jedoch in AnkiDroid verwenden, erfolgt die Eingabe nur über Schaltflächen, sodass keine Tastaturhinweise verwendet werden. Es ist nicht so bequem, ein großes Kreuzworträtsel auf Android zu lesen, und es ist schwierig, sich viele Wörter auf einmal zu merken. Beschränken Sie Ihr Kreuzworträtsel daher auf etwa 20 Wörter.",
            "help_str7": "\nWenn Sie fremdsprachige Wortkarten mit den Feldern „Wort“, „Transkription“ usw. haben, Übersetzung, Beispiel und Übersetzung des Beispiels (die Reihenfolge der Felder ist nicht wichtig). Anschließend können Sie diese Einträge im Anki-Programm auswählen und in eine Datei (.txt) exportieren. Der Export erfolgt einfach als Text, ohne alle weiteren Parameter. Im Reiter mit den Wörtern gibt es eine Schaltfläche, mit der Sie Wörter aus einer Textdatei hinzufügen können. Wenn die Reihenfolge der Felder abweicht, müssen Sie das Textfeld (1=2=3=4=5) vor dem Hinzufügen ändern (oder danach, aber das gesamte Feld löschen und erneut hinzufügen).",
            "help_str8": "\nWenn ein Wort ein Beispiel hat, können Sie eine Liste von Wörtern mit Beispiel erstellen (dafür gibt es eine separate Schaltfläche). Da das Beispiel jedoch kein Wort vorschlagen sollte, wird dieses Wort durch *** ersetzt. Wenn Sie ein Wort im Kreuzworträtsel aussprechen, wird das Beispiel danach ausgesprochen, da es in derselben Sprache wie das Wort ist.",
            
            "var z_lang_front00": "Kreuzworträtsel",
            "var z_lang_front01": "Wortliste",
            "var z_lang_front02": "Alle anzeigen",
            "var z_lang_front03": "Alle verstecken",
            "var z_lang_front04": "Sprachsynthese",
            "var z_lang_front05": "Nur 1 anzeigen",
            "var z_lang_front1": "Hilfe",
            "var z_lang_front2": "Wir merken uns 5 Wörter, bis wir sie leicht abrufen können (normalerweise müssen wir diese Wörter 3 Mal im Kreis durchgehen).",
            "var z_lang_front3": "Diese 5 Wörter (Zeilen) sind durch eine Linie getrennt.",
            "var z_lang_front4": "Bevor wir ein Wort (einen Satz von Wörtern) zeigen, müssen wir uns jeden Buchstaben visuell vorstellen (buchstabenweise in unserer Vorstellung zeichnen, dass wir ihn schreiben oder auf dem Bildschirm tippen), uns erinnern, wie das Wort ausgesprochen wird. Nachdem das Wort vorgelesen wurde (wenn \"Sprachsynthese\" beim Anzeigen eines Wortes oder Satzes aktiviert ist), müssen wir dieses Wort zwei- oder dreimal wiederholen.",
            "var z_lang_front5": "Die Schaltfläche \"Alle anzeigen\" dient dazu, alle Blöcke (in []) anzuzeigen. Sie ist nützlich, wenn Sie sich schnell erinnern müssen und nicht lernen müssen.",
            "var z_lang_front6": "Die Schaltfläche \"Alle verstecken\" dient dazu, alle Blöcke zu verstecken, um dann mit dem Lernprozess fortzufahren.",
            "var z_lang_front7": "Sie können auf das Feld mit der \"Nur 1 anzeigen\"-Markierung (aktiviert) klicken, und dann werden vor dem Anzeigen des gewünschten Blocks alle anderen versteckt. Dies hilft, sich besser auf einen Block zu konzentrieren, und ist nützlich, weil Sie vor dem Öffnen eines anderen Blocks versuchen sollten, sich daran zu erinnern, was dort steht, was das Einprägen unterstützt.",
            "var z_lang_front8": "Das Feld mit dem \"Sprachsynthese\"-Häkchen kann deaktiviert werden, wenn Sie die synthetisierte Stimme nicht mögen (abhängig von den Systemeinstellungen).",
            "var z_lang_front9": "Diese Funktion zum Verstecken und Öffnen von Blöcken ermöglicht es Ihnen, die gewünschte Lernreihenfolge zu organisieren: Öffnen Sie ein Wort und erinnern Sie sich an die Übersetzung oder umgekehrt, öffnen Sie die Übersetzung und erinnern Sie sich an das Wort.",
            "var z_lang_front10": "Sie sind in der Reihenfolge des Lernens von Wörtern nicht eingeschränkt, aber es ist dennoch ratsam, etwa 5 Wörter gut zu lernen, bevor Sie mit dem Lernen der nächsten 5 Wörter fortfahren.",
            "var z_lang_back1": "Dieses interaktive Kreuzworträtsel erfordert JavaScript und einen aktuellen Webbrowser, einschließlich Windows Internet Explorer, Mozilla Firefox, Google Chrome oder Apple Safari. Wenn Sie Skripte auf Webseiten deaktiviert haben, aktivieren Sie sie bitte wieder und laden Sie die Seite neu. Wenn diese Webseite auf Ihrem Computer gespeichert ist, müssen Sie möglicherweise auf die gelbe Informationsleiste oben oder unten auf der Seite klicken, um das Laden des Rätsels zu ermöglichen.",
            "var z_lang_back2": "Glückwunsch!",
            "var z_lang_back3": "Sie haben dieses Kreuzworträtsel gelöst",
            "var z_lang_back4": "Willkommen!",
            "var z_lang_back5": "Klicken Sie auf ein Wort im Rätsel, um zu beginnen.",
            "var z_lang_back6": "Lösen",
            "var z_lang_back7": "OK",
            "var z_lang_back8": "Abbrechen",
            "var z_lang_back9": "Rätsel überprüfen",
            "var z_lang_back10": "Bitte warten Sie, während das Kreuzworträtsel geladen wird...",
            "var z_lang_back11": "Waagerecht, Buchstaben",
            "var z_lang_back12": "Senkrecht, Buchstaben",
            "var z_lang_back13": "Das von Ihnen eingegebene Wort enthält ungültige Zeichen. Bitte geben Sie nur Buchstaben in das Feld oben ein.",
            "var z_lang_back14": "Sie haben nicht genug Buchstaben eingegeben. Gesamtzahl der Buchstaben in diesem Wort",
            "var z_lang_back15": "Sie haben zu viele Buchstaben eingegeben. Gesamtzahl der Buchstaben in diesem Wort",
            "var z_lang_back16": "Fehler",
            "var z_lang_back17": "Unvollständige Wörter",
            "var z_lang_back18": "Beenden",
            "var z_lang_back19" : "Vorgeschlagene Wörter"
        },        
        "es": {
            "Unable_to_determine_active_field": "No se pudo determinar el campo activo.",
            "Invalid_field_index": "Índice de campo no válido.",  
            "Invalid_field_type": "El tipo de registro debe ser 'Crossword' o contener 6 campos especificados.\nEl cursor debe estar en uno de estos campos:",
            "WindowTitle": "Crossword for EclipseCrossword",
            "HelpText": "Aquí va el texto de ayuda...",
            "Help": "Ayuda",
            "HelpTab": "Ayuda",
            "WordField": "Campo: 'word=transcription=translation=example=extranslation'",
            "OrderFields": "El orden de los campos de inserción es:",
            "Clear": "Limpiar",
            "AddFromTxt": "Añadir desde archivo TXT y convertir TAB a =",
            "CreateHint1": "Crear 'Word_hint' (palabra: traducción)",
            "CreateHint2": "Crear 'Word_hint' (palabra: ejemplo)",
            "WordTab": "Palabras",
            "WordHintField": "Campo: 'Word_hint' (tipo de archivo ewl)",
            "SaveEWL": "Guardar en archivo *.ewl",
            "HintTab": "Palabra: Pista",
            "CrosswordCode": "Campo: 'Crossword_code'",
            "PasteHTML": "Pegar desde archivo de crucigrama *.html",
            "CodeTab": "Código de crucigrama",
            "Warning": "Advertencia",
            "NoContent": "¡No hay contenido para guardar en el campo 'Word_hint'!",
            "SaveEWLFile": "Guardar archivo de pistas",
            "Success": "Éxito",
            "FileSaved": "¡Archivo guardado correctamente!",
            "Error": "Error",
            "SaveError": "Error al guardar el archivo: ",
            "OpenHTMLFile": "Abrir archivo HTML de crucigrama",
            "InvalidFile": "Archivo no válido",
            "NotCrosswordFile": "El archivo seleccionado no parece ser un crucigrama (falta 'CrosswordWidth =')",
            "InvalidFormat": "Formato no válido",
            "NoEndMarker": "No se encontró el marcador final '//-->' en el archivo",
            "CodeImported": "¡Código de crucigrama importado correctamente!",
            "ReadError": "Error al leer el archivo: ",   
            "OpenTXTFile": "Abrir archivo TXT exportado de Anki",
            "NotAnkiExport": "El archivo seleccionado no es una exportación válida de Anki (falta '#separator:tab' en la primera línea)",
            "HTMLWarning": "Advertencia HTML",
            "HTMLNotAllowed": "HTML no está permitido en el archivo de exportación",
            "InvalidOrder": "Orden no válido",
            "OrderFormatError": "El orden de campos debe ser números separados por '=' (ej. '1=2=3=4=5')",
            "ImportSuccess": "Importado desde archivo y líneas añadidas: ",
            "ImportError": "Error al importar el archivo: ",
            "NoContentWordField": "¡No hay contenido en el campo de palabra!",
            "NoValidLines": "No se encontraron líneas válidas para crear pistas",
            "SelectEncoding": "Seleccionar codificación de archivo",
            "ChooseEncoding": "Elegir codificación de texto:",
            "FileSavedEncoding": "Archivo guardado correctamente, codificación: ",
            "Save": "💾 Guardar",
            "FieldsUpdated": "¡Todos los campos se han actualizado correctamente!",
            "SaveErrorField": "Error al guardar los campos: ",
            "Close": "Cerrar",
            "Saved": "Guardado",
            "Solution_hint": "Pista de la solución",
            "No_solution_hint": "Sin pista de la solución",
            "Clue_array_not_found": "¡Matriz Clue no encontrada en el código!",
            "Failed_to_parse_Clue_array": "¡No se pudo analizar el array Clue!",
            "No_match_found_for_Clue_item": "No se encontró coincidencia para el elemento Clue",

            "help_str1": "Este complemento de Anki está diseñado para simplificar la creación de crucigramas con el programa gratuito https://www.eclipsecrossword.com/\nEl programa EclipseCrossword es solo para Windows, pero solo se necesita una vez para generar el código.",
            "help_str2": "\nSi tienes un crucigrama de EclipseCrossword ya creado, guardado como HTML con JavaScript, puedes abrir inmediatamente la última pestaña y usar el botón para insertar desde el archivo para obtener el código.\nAl final del código aparece \"OnlyCheckOnce = false;\", lo que significa que puedes comprobar las palabras del crucigrama varias veces, no solo una. La línea \"Solve = false;\" indica que no habrá pistas. Puedes cambiar \"Solve\" manualmente o con los botones.",
            "help_str3": "\nEl crucigrama se muestra en el reverso de la tarjeta. Y en el anverso, Palabras.\nLa pestaña de palabras puede estar vacía si no desea añadir ninguna sugerencia, pero puede ser una simple lista de palabras (o sugerencias).",
            "help_str4": "\nEn la pestaña de palabras, puede introducir no solo palabras, sino también una traducción de la palabra == (pista, definición).\nAl escribir ==, se omite la transcripción, que no es necesaria en un crucigrama normal.\nPuede hacer clic en el botón para crear datos para la tercera pestaña o introducirlos usted mismo, ya que el formato no es complicado:\npalabra: pista\n(tenga en cuenta que debe haber dos espacios después de los dos puntos).\nPuede mezclar esta lista de palabras, limitarla al número necesario (se recomienda un máximo de 20) y luego ordenarla si es necesario.",
            "help_str5": "\nLos datos de la lista de palabras se pueden guardar en un archivo con el formato \"*.ewl\" y abrir con el programa EclipseCrossword para generar un nuevo crucigrama, guardándolo como archivo. \"*.html\" y posterior pegado del código del crucigrama desde este archivo (el botón de la última pestaña).\n\nEl programa EclipseCrossword es muy antiguo y aún no admite el formato UTF-8, así que guárdelo con su codificación. Si se encuentra un carácter fuera de la codificación ANSI, se escribirá en el campo \"UTF=ANSI\" y se colocará un signo de interrogación después del signo igual. Este signo de interrogación debe reemplazarse con un carácter temporal que no esté en las palabras, por ejemplo, con dígitos diferentes (del 0 al 9). Estos caracteres temporales se reemplazarán al presionar el botón \"REPL ClueArray ANSI->UTF\" y, si todos los reemplazos son correctos, el algoritmo recibirá una lista de palabras \"Word\" de la pestaña con palabras que usan una pista. Para ello, haga clic en uno de los botones para permitir o prohibir las pistas.",
            "help_str6": "\nTenga en cuenta que, además del título, el registro tiene dos campos más: \"Idioma_Síntesis_de_Voz\" y \"Símbolos_para_botones\".\nNormalmente, estos campos están vacíos; se asume que el idioma es inglés y que todos los símbolos son para botones. Si sus palabras están en otro idioma, debe ingresar una línea con el formato \"Etiqueta de idioma BCP 47\" en el campo \"Idioma_Síntesis_de_Voz\". Por ejemplo, para alemán, debe escribir \"de-DE\" (sin comillas, por supuesto).\nEl campo \"Símbolos_para_botones\" puede dejarse en blanco; sin embargo, si lo usa en AnkiDroid, la escritura se realiza solo mediante botones, simplemente para evitar las sugerencias del teclado. No es muy cómodo ver un crucigrama grande en Android y es difícil recordar muchas palabras a la vez, así que limite su crucigrama a unas 20 palabras.",
            "help_str7": "\nSi tiene tarjetas de palabras en idiomas extranjeros con los campos: palabra, transcripción, traducción, Ejemplo y traducción del ejemplo (el orden de los campos no es importante). Después, puede seleccionar estas entradas en el programa Anki y exportarlas a un archivo (.txt). Exporte simplemente como texto, sin ningún otro parámetro. En la pestaña de palabras, hay un botón para agregar palabras desde un archivo de texto. Si el orden de los campos es diferente, deberá cambiar el campo de texto (1=2=3=4=5) antes de agregar (o después, pero borre todo el campo y vuelva a agregarlo).",
            "help_str8": "\nCuando una palabra tiene un ejemplo, puede crear una lista de palabras con un ejemplo (hay un botón aparte para esto), pero como el ejemplo no debe sugerir una palabra, esta se reemplaza por ***. Al pronunciar una palabra en el crucigrama, el ejemplo se pronunciará después, ya que está en el mismo idioma que la palabra.",
                    
            "var z_lang_front00": "Crucigrama",
            "var z_lang_front01": "Lista de palabras",
            "var z_lang_front02": "Mostrar todo",
            "var z_lang_front03": "Ocultar todo",
            "var z_lang_front04": "Síntesis de voz",
            "var z_lang_front05": "Mostrar solo 1",
            "var z_lang_front1": "Ayuda",
            "var z_lang_front2": "Memorizamos 5 palabras hasta que podamos recordarlas fácilmente (normalmente necesitamos repasar estas palabras 3 veces en círculo).",
            "var z_lang_front3": "Estas 5 palabras (líneas) están separadas por una línea.",
            "var z_lang_front4": "Antes de mostrar una palabra (una oración de palabras), necesitamos recordar visualmente cada letra (imaginando letra por letra que la estamos escribiendo o tecleando en la pantalla), recordar cómo se pronuncia la palabra. Después de que la palabra sea vocalizada (si la \"Síntesis de voz\" está activada al mostrar una palabra u oración), necesitamos decirnos esta palabra dos o tres veces más.",
            "var z_lang_front5": "El botón \"Mostrar todo\" está diseñado para mostrar todos los bloques (en []). Es útil si necesitas recordar rápidamente y no necesitas estudiar.",
            "var z_lang_front6": "El botón \"Ocultar todo\" está diseñado para ocultar todos los bloques y así proceder con el proceso de memorización.",
            "var z_lang_front7": "Puedes hacer clic en el campo con la marca \"Mostrar solo 1\" (activada) y luego, antes de mostrar el bloque deseado, todos los demás se ocultarán. Esto ayuda a concentrarse mejor en un bloque y es útil, porque antes de abrir otro bloque, deberías intentar recordar qué hay allí, y esto ayuda a memorizar.",
            "var z_lang_front8": "El campo con la casilla de \"Síntesis de voz\" puede desactivarse si no te gusta la voz sintetizada (dependiendo de la configuración del sistema).",
            "var z_lang_front9": "Esta funcionalidad de ocultar y abrir bloques te permite organizar el orden deseado de memorización: abrir una palabra y recordar la traducción o viceversa, abrir la traducción y recordar la palabra.",
            "var z_lang_front10": "No estás limitado en la secuencia de memorización de palabras, pero aún así es recomendable memorizar bien unas 5 palabras antes de pasar a memorizar las otras 5.",
            "var z_lang_back1": "Este crucigrama interactivo requiere JavaScript y cualquier navegador web reciente, incluyendo Windows Internet Explorer, Mozilla Firefox, Google Chrome o Apple Safari. Si has desactivado los scripts de la página web, por favor actívalos y actualiza la página. Si esta página web está guardada en tu computadora, puede que necesites hacer clic en la barra amarilla de información en la parte superior o inferior de la página para permitir que se cargue el crucigrama.",
            "var z_lang_back2": "¡Felicitaciones!",
            "var z_lang_back3": "Has completado este crucigrama",
            "var z_lang_back4": "¡Bienvenido!",
            "var z_lang_back5": "Haz clic en una palabra del crucigrama para comenzar.",
            "var z_lang_back6": "Resolver",
            "var z_lang_back7": "Aceptar",
            "var z_lang_back8": "Cancelar",
            "var z_lang_back9": "Verificar crucigrama",
            "var z_lang_back10": "Por favor espera mientras se carga el crucigrama...",
            "var z_lang_back11": "Horizontal, letras",
            "var z_lang_back12": "Vertical, letras",
            "var z_lang_back13": "La palabra que escribiste contiene caracteres inválidos. Por favor escribe solo letras en el cuadro de arriba.",
            "var z_lang_back14": "No escribiste suficientes letras. Total de letras en esta palabra",
            "var z_lang_back15": "Escribiste demasiadas letras. Total de letras en esta palabra",
            "var z_lang_back16": "Errores",
            "var z_lang_back17": "Palabras incompletas",
            "var z_lang_back18": "Finalizar",
            "var z_lang_back19" : "Palabras sugeridas"
        },
        "fr": {
            "Unable_to_determine_active_field": "Impossible de déterminer le champ actif.",
            "Invalid_field_index": "Index de champ invalide.",  
            "Invalid_field_type": "Le type d'enregistrement doit être 'Crossword' ou contenir 6 champs spécifiés.\nLe curseur doit être dans l'un de ces champs :",
            "WindowTitle": "Crossword for EclipseCrossword",
            "HelpText": "Ici se trouve le texte d'aide...",
            "Help": "Aide",
            "HelpTab": "Aide",
            "WordField": "Champ: 'word=transcription=translation=example=extranslation'",
            "OrderFields": "L'ordre des champs d'insertion est :",
            "Clear": "Effacer",
            "AddFromTxt": "Ajouter depuis un fichier TXT et convertir TAB en =",
            "CreateHint1": "Créer 'Word_hint' (mot : traduction)",
            "CreateHint2": "Créer 'Word_hint' (mot : exemple)",
            "WordTab": "Mots",
            "WordHintField": "Champ : 'Word_hint' (type de fichier ewl)",
            "SaveEWL": "Enregistrer dans le fichier *.ewl",
            "HintTab": "Mot : Indice",
            "CrosswordCode": "Champ : 'Crossword_code'",
            "PasteHTML": "Coller depuis un fichier de mots croisés *.html",
            "CodeTab": "Code de mots croisés",
            "Warning": "Avertissement",
            "NoContent": "Aucun contenu à enregistrer dans le champ 'Word_hint' !",
            "SaveEWLFile": "Enregistrer le fichier d'indices",
            "Success": "Succès",
            "FileSaved": "Fichier enregistré avec succès !",
            "Error": "Erreur",
            "SaveError": "Échec de l'enregistrement du fichier : ",
            "OpenHTMLFile": "Ouvrir un fichier HTML de mots croisés",
            "InvalidFile": "Fichier invalide",
            "NotCrosswordFile": "Le fichier sélectionné ne semble pas être un fichier de mots croisés (manque 'CrosswordWidth =')",
            "InvalidFormat": "Format invalide",
            "NoEndMarker": "Impossible de trouver le marqueur de fin '//-->' dans le fichier",
            "CodeImported": "Code de mots croisés importé avec succès !",
            "ReadError": "Échec de la lecture du fichier : ",   
            "OpenTXTFile": "Ouvrir un fichier TXT exporté d'Anki",
            "NotAnkiExport": "Le fichier sélectionné n'est pas une exportation Anki valide (manque '#separator:tab' en première ligne)",
            "HTMLWarning": "Avertissement HTML",
            "HTMLNotAllowed": "Le HTML n'est pas autorisé dans le fichier d'exportation",
            "InvalidOrder": "Ordre invalide",
            "OrderFormatError": "L'ordre des champs doit être des nombres séparés par '=' (ex. '1=2=3=4=5')",
            "ImportSuccess": "Importé depuis le fichier et lignes ajoutées : ",
            "ImportError": "Échec de l'importation du fichier : ",
            "NoContentWordField": "Aucun contenu dans le champ de mot !",
            "NoValidLines": "Aucune ligne valide trouvée pour créer des indices",
            "SelectEncoding": "Sélectionner l'encodage du fichier",
            "ChooseEncoding": "Choisir l'encodage du texte :",
            "FileSavedEncoding": "Fichier enregistré avec succès, encodage : ",
            "Save": "💾 Enregistrer",
            "FieldsUpdated": "Tous les champs ont été mis à jour avec succès !",
            "SaveErrorField": "Échec de l'enregistrement des champs : ",
            "Close": "Fermer",
            "Saved": "Enregistré",
            "Solution_hint": "Indice de la solution",
            "No_solution_hint": "Pas d'indice de solution",
            "Clue_array_not_found": "Tableau Clue introuvable dans le code !",
            "Failed_to_parse_Clue_array": "Échec de l'analyse du tableau Clue !",
            "No_match_found_for_Clue_item": "Aucune correspondance trouvée pour l'élément Clue",
            
            "help_str1": "Ce module complémentaire Anki est conçu pour simplifier la création de mots croisés à l'aide du programme gratuit https://www.eclipsecrossword.com/\nLe programme EclipseCrossword est uniquement disponible pour Windows, mais vous n'en avez besoin qu'une seule fois pour générer le code.",
            "help_str2": "\nSi vous disposez d'un mot croisé EclipseCrossword prêt à l'emploi enregistré au format HTML avec JavaScript, vous pouvez ouvrir le dernier onglet et utiliser le bouton « Insérer » pour obtenir le code.\nÀ la fin du code, vous trouverez « OnlyCheckOnce = false; » : cela signifie que vous pouvez vérifier les mots du mot croisé plusieurs fois, et non une seule fois. La ligne « Solve = false; » indique qu'il n'y aura pas d'indices. Vous pouvez modifier « Solve » manuellement ou à l'aide des boutons.",
            "help_str3": "\nLe mot croisé lui-même est affiché au verso de la carte. Et au recto de la carte, Mots.\nL'onglet Mots peut être vide si vous ne souhaitez rien demander, mais il peut également se présenter sous la forme d'une simple liste de mots (ou de questions).",
            "help_str4": "\nDans l'onglet Mots, vous pouvez saisir non seulement des mots, mais aussi une traduction (indice, définition) du mot.\nEn écrivant ==, vous ignorez la transcription, qui n'est pas nécessaire dans une grille de mots croisés classique.\nVous pouvez cliquer sur le bouton pour créer des données pour le troisième onglet ou les saisir vous-même, car le format est simple :\nmot : indice\n(attention, deux espaces après les deux points).\nVous pouvez mélanger cette liste de mots, la limiter au nombre requis (20 maximum recommandés) et la trier si nécessaire.",
            "help_str5": "\nLes données de la liste de mots peuvent être enregistrées dans un fichier au format « *.ewl » et ouvertes par le programme EclipseCrossword pour générer une nouvelle grille de mots croisés, puis enregistrées sous forme de fichier. \"*.html\", puis collez le code des mots croisés depuis ce fichier (bouton du dernier onglet).\n\nLe programme EclipseCrossword est très ancien et ne prend pas encore en charge le format UTF-8. Enregistrez donc votre encodage. Si un caractère hors du codage ANSI est détecté, il sera écrit dans le champ \"UTF=ANSI\" et un point d'interrogation sera placé après le signe égal. Ce point d'interrogation doit être remplacé par un caractère temporaire absent des mots, par exemple avec des chiffres différents (de 0 à 9). Ces caractères temporaires seront ensuite remplacés lorsque vous cliquerez sur le bouton \"REPL ClueArray ANSI->UTF\". Si tous les remplacements sont corrects, l'algorithme recevra une liste de mots \"Word\" de l'onglet contenant des mots avec un indice. Pour ce faire, cliquez sur l'un des boutons pour autoriser ou interdire les indices. ",
            "help_str6": "\nVeuillez noter qu'en plus du titre, l'enregistrement comporte deux champs supplémentaires : \"Langue_Synthèse Vocale\" et \"Symboles_pour_boutons\".\nGénéralement, ces champs sont vides ; l'anglais est alors utilisé, ainsi que tous les symboles pour les boutons. Si vos mots sont dans une autre langue, vous devez saisir une ligne au format \"Balise de langue BCP 47\" dans le champ \"Langue_Synthèse Vocale\". Par exemple, pour l'allemand, vous devez écrire \"de-DE\" (sans les guillemets, bien sûr).\nLe champ \"Symboles_pour_boutons\" peut être laissé vide, mais si vous l'utilisez dans AnkiDroid, la saisie se fait uniquement via les boutons, afin d'éviter les aides clavier. Consulter de grands mots croisés sur Android n'est pas très pratique, et il est difficile de mémoriser plusieurs mots à la fois. Limitez donc vos mots croisés à environ 20 mots.",
            "help_str7": "\nSi vous avez des fiches de mots en langue étrangère avec les champs : mot, transcription, traduction, exemple et traduction de l'exemple (L'ordre des champs n'a pas d'importance). Vous pouvez ensuite sélectionner ces entrées dans le programme Anki et les exporter vers un fichier (.txt). Exportez simplement au format texte, sans aucun autre paramètre. Dans l'onglet Mots, un bouton permet d'ajouter des mots depuis un fichier texte. Si l'ordre des champs est différent, vous devrez modifier le champ de texte (1=2=3=4=5) avant l'ajout (ou après, mais videz le champ et ajoutez-le à nouveau).",
            "help_str8": "\nLorsqu'un mot a un exemple, vous pouvez créer une liste de mots avec un exemple (un bouton séparé est disponible). Cependant, comme l'exemple ne doit pas suggérer de mot, ce mot est remplacé par ***. Lorsque vous prononcez un mot dans les mots croisés, l'exemple sera prononcé après lui, car il est dans la même langue que le mot.",

            "var z_lang_front00": "Mots croisés",
            "var z_lang_front01": "Liste de mots",
            "var z_lang_front02": "Afficher tout",
            "var z_lang_front03": "Masquer tout",
            "var z_lang_front04": "Synthèse vocale",
            "var z_lang_front05": "Afficher seulement 1",
            "var z_lang_front1": "Aide",
            "var z_lang_front2": "Nous mémorisons 5 mots jusqu'à ce que nous puissions les rappeler facilement (généralement nous devons parcourir ces mots 3 fois en cercle).",
            "var z_lang_front3": "Ces 5 mots (lignes) sont séparés par une ligne.",
            "var z_lang_front4": "Avant d'afficher un mot (une phrase de mots), nous devons visualiser chaque lettre (en imaginant lettre par lettre que nous l'écrivons ou la tapons à l'écran), nous souvenir de la prononciation du mot. Après que le mot est énoncé (si la \"Synthèse vocale\" est activée lors de l'affichage d'un mot ou d'une phrase), nous devons nous répéter ce mot deux ou trois fois supplémentaires.",
            "var z_lang_front5": "Le bouton \"Afficher tout\" est conçu pour montrer tous les blocs (dans []). Il est utile si vous avez besoin de vous rappeler rapidement sans étudier.",
            "var z_lang_front6": "Le bouton \"Masquer tout\" est conçu pour cacher tous les blocs afin de pouvoir ensuite commencer le processus de mémorisation.",
            "var z_lang_front7": "Vous pouvez cliquer sur le champ avec l'option \"Afficher seulement 1\" (activée) et alors, avant d'afficher le bloc souhaité, tous les autres seront masqués. Cela aide à mieux se concentrer sur un bloc et c'est utile, car avant d'ouvrir un autre bloc, vous devriez essayer de vous souvenir de son contenu, ce qui facilite la mémorisation.",
            "var z_lang_front8": "Le champ avec la case à cocher \"Synthèse vocale\" peut être désactivé si vous n'aimez pas la voix synthétique (selon les paramètres système).",
            "var z_lang_front9": "Cette fonctionnalité de masquage et d'affichage des blocs vous permet d'organiser l'ordre de mémorisation souhaité : ouvrir un mot et se souvenir de sa traduction ou vice versa, ouvrir la traduction et se souvenir du mot.",
            "var z_lang_front10": "Vous n'êtes pas limité dans l'ordre de mémorisation des mots, mais il est tout de même conseillé de bien mémoriser environ 5 mots avant de passer à la mémorisation des 5 suivants.",
            "var z_lang_back1": "Ce mots croisés interactifs nécessitent JavaScript et un navigateur web récent, comme Windows Internet Explorer, Mozilla Firefox, Google Chrome ou Apple Safari. Si vous avez désactivé les scripts de page web, veuillez les réactiver et actualiser la page. Si cette page web est enregistrée sur votre ordinateur, vous devrez peut-être cliquer sur la barre d'information jaune en haut ou en bas de la page pour permettre le chargement du puzzle.",
            "var z_lang_back2": "Félicitations !",
            "var z_lang_back3": "Vous avez complété ces mots croisés",
            "var z_lang_back4": "Bienvenue !",
            "var z_lang_back5": "Cliquez sur un mot dans la grille pour commencer.",
            "var z_lang_back6": "Résoudre",
            "var z_lang_back7": "OK",
            "var z_lang_back8": "Annuler",
            "var z_lang_back9": "Vérifier la grille",
            "var z_lang_back10": "Veuillez patienter pendant le chargement des mots croisés...",
            "var z_lang_back11": "Horizontal, lettres",
            "var z_lang_back12": "Vertical, lettres",
            "var z_lang_back13": "Le mot que vous avez saisi contient des caractères invalides. Veuillez n'entrer que des lettres dans la case ci-dessus.",
            "var z_lang_back14": "Vous n'avez pas saisi assez de lettres. Nombre total de lettres dans ce mot",
            "var z_lang_back15": "Vous avez saisi trop de lettres. Nombre total de lettres dans ce mot",
            "var z_lang_back16": "Erreurs",
            "var z_lang_back17": "Mots incomplets",
            "var z_lang_back18": "Terminer",
            "var z_lang_back19" : "Mots suggérés"
        },        
        "it": {
            "Unable_to_determine_active_field": "Impossibile determinare il campo attivo.",
            "Invalid_field_index": "Indice del campo non valido.",  
            "Invalid_field_type": "Il tipo di record deve essere 'Crossword' o contenere 6 campi specificati.\nIl cursore deve essere in uno di questi campi:",
            "WindowTitle": "Crossword for EclipseCrossword",
            "HelpText": "Qui va il testo di aiuto...",
            "Help": "Aiuto",
            "HelpTab": "Aiuto",
            "WordField": "Campo: 'word=transcription=translation=example=extranslation'",
            "OrderFields": "L'ordine dei campi di inserimento è:",
            "Clear": "Pulisci",
            "AddFromTxt": "Aggiungi da file TXT e converti TAB in =",
            "CreateHint1": "Crea 'Word_hint' (parola: traduzione)",
            "CreateHint2": "Crea 'Word_hint' (parola: esempio)",
            "WordTab": "Parole",
            "WordHintField": "Campo: 'Word_hint' (tipo file ewl)",
            "SaveEWL": "Salva nel file *.ewl",
            "HintTab": "Parola: Suggerimento",
            "CrosswordCode": "Campo: 'Crossword_code'",
            "PasteHTML": "Incolla da file cruciverba *.html",
            "CodeTab": "Codice cruciverba",
            "Warning": "Avviso",
            "NoContent": "Nessun contenuto da salvare nel campo 'Word_hint'!",
            "SaveEWLFile": "Salva file suggerimenti",
            "Success": "Successo",
            "FileSaved": "File salvato con successo!",
            "Error": "Errore",
            "SaveError": "Salvataggio file fallito: ",
            "OpenHTMLFile": "Apri file HTML cruciverba",
            "InvalidFile": "File non valido",
            "NotCrosswordFile": "Il file selezionato non sembra essere un cruciverba (manca 'CrosswordWidth =')",
            "InvalidFormat": "Formato non valido",
            "NoEndMarker": "Impossibile trovare il marcatore di fine '//-->' nel file",
            "CodeImported": "Codice cruciverba importato con successo!",
            "ReadError": "Lettura file fallita: ",   
            "OpenTXTFile": "Apri file TXT esportato da Anki",
            "NotAnkiExport": "Il file selezionato non è un'esportazione Anki valida (manca '#separator:tab' nella prima riga)",
            "HTMLWarning": "Avviso HTML",
            "HTMLNotAllowed": "HTML non è permesso nel file di esportazione",
            "InvalidOrder": "Ordine non valido",
            "OrderFormatError": "L'ordine dei campi deve essere numeri separati da '=' (es. '1=2=3=4=5')",
            "ImportSuccess": "Importato da file e righe aggiunte: ",
            "ImportError": "Importazione file fallita: ",
            "NoContentWordField": "Nessun contenuto nel campo parola!",
            "NoValidLines": "Nessuna riga valida trovata per creare suggerimenti",
            "SelectEncoding": "Seleziona codifica file",
            "ChooseEncoding": "Scegli codifica testo:",
            "FileSavedEncoding": "File salvato con successo, codifica: ",
            "Save": "💾 Salva",
            "FieldsUpdated": "Tutti i campi sono stati aggiornati con successo!",
            "SaveErrorField": "Salvataggio campi fallito: ",
            "Close": "Chiudi",
            "Saved": "Salvato",
            "Solution_hint": "Suggerimento della soluzione",
            "No_solution_hint": "Nessun suggerimento della soluzione",
            "Clue_array_not_found": "Array Clue non trovato nel codice!",
            "Failed_to_parse_Clue_array": "Impossibile analizzare l'array Clue!",
            "No_match_found_for_Clue_item": "Nessuna corrispondenza trovata per l'elemento Clue",
           
            "help_str1": "Questo componente aggiuntivo Anki è progettato per semplificare la creazione di un cruciverba creato utilizzando il programma gratuito https://www.eclipsecrossword.com/\nIl programma EclipseCrossword è disponibile solo per Windows, ma è necessario utilizzarlo una sola volta per generare il codice del cruciverba.",
            "help_str2": "\nSe hai un cruciverba EclipseCrossword già pronto e salvato in formato HTML con JavaScript, puoi aprire immediatamente l'ultima scheda e utilizzare il pulsante per inserire il codice dal file.\nAlla fine del codice c'è \"OnlyCheckOnce = false;\" - questo significa che puoi controllare le parole del cruciverba più volte, non solo una. La riga \"Solve = false;\" indica che non ci saranno suggerimenti. Puoi modificare \"Solve\" manualmente o utilizzando i pulsanti.",
            "help_str3": "\nIl cruciverba vero e proprio è mostrato sul retro della scheda. E sul fronte della scheda, parole.\nLa scheda con le parole può essere vuota se non si desidera inserire alcun suggerimento, ma può essere sotto forma di un semplice elenco di parole (o suggerimenti).",
            "help_str4": "\nNella scheda con le parole, è possibile inserire non solo parole, ma anche una traduzione (suggerimento, definizione) di parola==.\nScrivendo ==, si salta la trascrizione, che non è necessaria in un cruciverba normale.\nÈ possibile fare clic sul pulsante per creare i dati per la terza scheda o inserirli manualmente, poiché il formato non è complicato:\nparola: suggerimento\n(nota che dovrebbero esserci 2 spazi dopo i due punti).\nÈ possibile modificare questo elenco di parole, limitarlo al numero richiesto (si consiglia non più di 20) e quindi ordinarlo se necessario.",
            "help_str5": "\nI dati dell'elenco di parole possono essere salvati in un file in formato \"*.ewl\" e aperti dal programma EclipseCrossword per generare un nuovo cruciverba, salvandolo come file \"*.html\" e successivo incollamento del codice del cruciverba da questo file (il pulsante nell'ultima scheda).\n\nIl programma EclipseCrossword è molto vecchio e non supporta ancora il formato UTF-8, quindi salvatelo nella vostra codifica. Se viene rilevato un carattere al di fuori della codifica ANSI, verrà scritto nel campo \"UTF=ANSI\" e verrà inserito un punto interrogativo dopo il segno di uguale. Questo punto interrogativo deve essere sostituito con un carattere temporaneo non presente nelle parole, ad esempio con cifre diverse (da 0 a 9). Questi caratteri temporanei verranno quindi sostituiti quando si preme il pulsante \"REPL ClueArray ANSI->UTF\" e, se tutte le sostituzioni sono corrette, l'algoritmo riceverà un elenco di parole \"Parola\" dalla scheda con parole che utilizzano un suggerimento. Per farlo, fare clic su uno dei pulsanti per consentire o impedire i suggerimenti.",
            "help_str6": "\nSi noti che, oltre al titolo, il record ha altri due campi: \"Language_SpeechSynthesis\" e \"Symbols_for_buttons\".\nDi solito questi campi sono vuoti, quindi si presume che l'inglese sia la lingua di partenza e che tutti i simboli per i pulsanti siano presenti. Se le parole sono in un'altra lingua, è necessario inserire una riga nel formato \"BCP 47 language tag\" nel campo \"Language_SpeechSynthesis\"; ad esempio, per il tedesco è necessario scrivere \"de-DE\" (senza virgolette, ovviamente).\nIl campo \"Symbols_for_buttons\" potrebbe essere lasciato vuoto, ma comunque, se lo si utilizza in AnkiDroid, la digitazione avviene solo tramite pulsanti, semplicemente in modo che non vengano utilizzati i suggerimenti della tastiera. Non è così comodo consultare un cruciverba di grandi dimensioni su Android, ed è difficile ricordare molte parole contemporaneamente, quindi limitare il cruciverba a circa 20 parole.",
            "help_str7": "\nSe si dispone di schede con parole in lingua straniera con i campi: parola, trascrizione, traduzione, esempio e traduzione dell'esempio (il L'ordine dei campi non è importante). È quindi possibile selezionare queste voci nel programma Anki ed esportarle in un file (.txt). Esportare semplicemente come testo, senza altri parametri. Nella scheda con le parole è presente un pulsante con cui è possibile aggiungere parole da un file di testo. Se l'ordine dei campi è diverso, sarà necessario modificare il campo di testo (1=2=3=4=5) prima di aggiungerlo (o dopo, ma svuotando l'intero campo e aggiungendolo di nuovo).",
            "help_str8": "\nQuando una parola ha un esempio, è possibile creare un elenco di parole con un esempio (c'è un pulsante separato per questo), ma poiché l'esempio non dovrebbe suggerire una parola, questa parola viene sostituita con ***. Quando si pronuncia una parola nel cruciverba, l'esempio verrà pronunciato dopo di essa, poiché è nella stessa lingua della parola.",

            "var z_lang_front00": "Cruciverba",
            "var z_lang_front01": "Lista di parole",
            "var z_lang_front02": "Mostra tutto",
            "var z_lang_front03": "Nascondi tutto",
            "var z_lang_front04": "Sintesi vocale",
            "var z_lang_front05": "Mostra solo 1",
            "var z_lang_front1": "Aiuto",
            "var z_lang_front2": "Memorizziamo 5 parole finché non riusciamo a richiamarle facilmente (di solito dobbiamo ripetere queste parole 3 volte in circolo).",
            "var z_lang_front3": "Queste 5 parole (righe) sono separate da una linea.",
            "var z_lang_front4": "Prima di mostrare una parola (una frase di parole), dobbiamo richiamare visivamente ogni lettera (immaginando lettera per lettera che la stiamo scrivendo o digitando sullo schermo), ricordare come si pronuncia la parola. Dopo che la parola è stata pronunciata (se la \"Sintesi vocale\" è abilitata quando si mostra una parola o frase), dobbiamo ripeterci questa parola altre due o tre volte.",
            "var z_lang_front5": "Il pulsante \"Mostra tutto\" è progettato per mostrare tutti i blocchi (in []). È utile se hai bisogno di richiamare rapidamente e non devi studiare.",
            "var z_lang_front6": "Il pulsante \"Nascondi tutto\" è progettato per nascondere tutti i blocchi per poter poi procedere con il processo di memorizzazione.",
            "var z_lang_front7": "Puoi cliccare sul campo con il flag \"Mostra solo 1\" (attivato) e poi, prima di mostrare il blocco desiderato, tutti gli altri saranno nascosti. Questo aiuta a concentrarsi meglio su un blocco ed è utile, perché prima di aprire un altro blocco, dovresti provare a ricordare cosa c'è, e questo aiuta la memorizzazione.",
            "var z_lang_front8": "Il campo con la casella di spunta \"Sintesi vocale\" può essere disabilitato se non ti piace la voce sintetizzata (a seconda delle impostazioni di sistema).",
            "var z_lang_front9": "Questa funzionalità di nascondere e aprire i blocchi ti permette di organizzare l'ordine di memorizzazione desiderato: apri una parola e ricorda la traduzione o viceversa, apri la traduzione e ricorda la parola.",
            "var z_lang_front10": "Non sei limitato nella sequenza di memorizzazione delle parole, ma è comunque consigliabile memorizzare bene circa 5 parole prima di passare a memorizzare le altre 5.",
            "var z_lang_back1": "Questo cruciverba interattivo richiede JavaScript e un browser web recente, tra cui Windows Internet Explorer, Mozilla Firefox, Google Chrome o Apple Safari. Se hai disabilitato gli script delle pagine web, per favore riattivali e aggiorna la pagina. Se questa pagina web è salvata sul tuo computer, potresti dover cliccare sulla barra informativa gialla in alto o in basso nella pagina per permettere il caricamento del cruciverba.",
            "var z_lang_back2": "Congratulazioni!",
            "var z_lang_back3": "Hai completato questo cruciverba",
            "var z_lang_back4": "Benvenuto!",
            "var z_lang_back5": "Clicca su una parola nel cruciverba per iniziare.",
            "var z_lang_back6": "Risolvi",
            "var z_lang_back7": "OK",
            "var z_lang_back8": "Annulla",
            "var z_lang_back9": "Controlla cruciverba",
            "var z_lang_back10": "Attendere mentre il cruciverba viene caricato...",
            "var z_lang_back11": "Orizzontali, lettere",
            "var z_lang_back12": "Verticali, lettere",
            "var z_lang_back13": "La parola che hai digitato contiene caratteri non validi. Digita solo lettere nella casella sopra.",
            "var z_lang_back14": "Non hai digitato abbastanza lettere. Lettere totali in questa parola",
            "var z_lang_back15": "Hai digitato troppe lettere. Lettere totali in questa parola",
            "var z_lang_back16": "Errori",
            "var z_lang_back17": "Parole incomplete",
            "var z_lang_back18": "Termina",
            "var z_lang_back19" : "Parole suggerite"            
        },                
        "pt": {
            "Unable_to_determine_active_field": "Não foi possível determinar o campo ativo.",
            "Invalid_field_index": "Índice de campo inválido.",  
            "Invalid_field_type": "O tipo de registo deve ser 'Crossword' ou conter 6 campos especificados.\nO cursor deve estar num destes campos:",
            "WindowTitle": "Crossword for EclipseCrossword",
            "HelpText": "Aqui vai o texto de ajuda...",
            "Help": "Ajuda",
            "HelpTab": "Ajuda",
            "WordField": "Campo: 'word=transcription=translation=example=extranslation'",
            "OrderFields": "A ordem dos campos de inserção é:",
            "Clear": "Limpar",
            "AddFromTxt": "Adicionar do ficheiro TXT e converter TAB para =",
            "CreateHint1": "Criar 'Word_hint' (palavra: tradução)",
            "CreateHint2": "Criar 'Word_hint' (palavra: exemplo)",
            "WordTab": "Palavras",
            "WordHintField": "Campo: 'Word_hint' (tipo de ficheiro ewl)",
            "SaveEWL": "Guardar em ficheiro *.ewl",
            "HintTab": "Palavra: Dica",
            "CrosswordCode": "Campo: 'Crossword_code'",
            "PasteHTML": "Colar do ficheiro de palavras cruzadas *.html",
            "CodeTab": "Código de palavras cruzadas",
            "Warning": "Aviso",
            "NoContent": "Sem conteúdo para guardar no campo 'Word_hint'!",
            "SaveEWLFile": "Guardar ficheiro de dicas",
            "Success": "Sucesso",
            "FileSaved": "Ficheiro guardado com sucesso!",
            "Error": "Erro",
            "SaveError": "Falha ao guardar ficheiro: ",
            "OpenHTMLFile": "Abrir ficheiro HTML de palavras cruzadas",
            "InvalidFile": "Ficheiro inválido",
            "NotCrosswordFile": "O ficheiro selecionado não parece ser de palavras cruzadas (falta 'CrosswordWidth =')",
            "InvalidFormat": "Formato inválido",
            "NoEndMarker": "Não foi possível encontrar o marcador de fim '//-->' no ficheiro",
            "CodeImported": "Código de palavras cruzadas importado com sucesso!",
            "ReadError": "Falha ao ler ficheiro: ",   
            "OpenTXTFile": "Abrir ficheiro TXT exportado do Anki",
            "NotAnkiExport": "O ficheiro selecionado não é uma exportação válida do Anki (falta '#separator:tab' na primeira linha)",
            "HTMLWarning": "Aviso HTML",
            "HTMLNotAllowed": "HTML não é permitido no ficheiro de exportação",
            "InvalidOrder": "Ordem inválida",
            "OrderFormatError": "A ordem dos campos deve ser números separados por '=' (ex. '1=2=3=4=5')",
            "ImportSuccess": "Importado do ficheiro e linhas adicionadas: ",
            "ImportError": "Falha ao importar ficheiro: ",
            "NoContentWordField": "Sem conteúdo no campo de palavra!",
            "NoValidLines": "Não foram encontradas linhas válidas para criar dicas",
            "SelectEncoding": "Selecionar codificação do ficheiro",
            "ChooseEncoding": "Escolher codificação de texto:",
            "FileSavedEncoding": "Ficheiro guardado com sucesso, codificação: ",
            "Save": "💾 Guardar",
            "FieldsUpdated": "Todos os campos foram atualizados com sucesso!",
            "SaveErrorField": "Falha ao guardar campos: ",
            "Close": "Fechar",
            "Saved": "Guardado",
            "Solution_hint": "Dica da solução",
            "No_solution_hint": "Sem dica da solução",
            "Clue_array_not_found": "Array Clue não encontrado no código!",
            "Failed_to_parse_Clue_array": "Falha ao analisar o array Clue!",
            "No_match_found_for_Clue_item": "Nenhuma correspondência encontrada para o item Clue",

            "help_str1": "Este add-on Anki foi desenvolvido para simplificar a construção de palavras cruzadas utilizando o programa gratuito https://www.eclipsecrossword.com/. O programa EclipseCrossword é exclusivo para Windows, mas só precisa dele uma vez para gerar o código das palavras cruzadas.",
            "help_str2": "\nSe tiver um jogo de palavras cruzadas EclipseCrossword pronto, guardado como HTML com JavaScript, pode abrir imediatamente o último separador e utilizar o botão para introduzir o código do ficheiro. No final do código, existe \"OnlyCheckOnce = false;\" - isto significa que pode verificar as palavras das palavras cruzadas várias vezes, e não apenas uma. A linha \"Solve = false;\" indica que não haverá dicas. Pode alterar \"Solve\" manualmente ou utilizando os botões.",
            "help_str3": "\nAs palavras cruzadas em si são mostradas no verso do cartão. E na frente do cartão, Palavras. \nO separador com palavras pode estar vazio se não quiser sugerir nada, mas pode estar sob a forma de uma lista simples de palavras (ou sugestões).",
            "help_str4": "\nNo separador com palavras, pode introduzir não só palavras, mas uma tradução de palavras (dica, definição). \nAo escrever ==, salta a transcrição, que não é necessária nas palavras cruzadas comuns. \nPode clicar no botão para criar dados para o terceiro separador ou inseri-los você mesmo, uma vez que o formato aí não é complicado:\npalavra: dica\n(note que deve haver 2 espaços após os dois pontos). \nPode misturar esta lista de palavras, limitá-la ao número necessário (recomenda-se não mais de 20) e, em seguida, classificá-la por ordem, se necessário.",
            "help_str5": "\nOs dados da lista de palavras podem ser guardados num ficheiro no formato \"*. ewl\" e abertos pelo programa EclipseCrossword para posterior geração de uma nova palavra cruzada, guardando-a como um ficheiro \"*. html\" e a posterior colagem do código das palavras cruzadas deste ficheiro (o botão no último separador). \n\nO programa EclipseCrossword é muito antigo e ainda não suporta o formato UTF-8, por isso guarde-o na sua codificação. Se um caractere da codificação ANSI for encontrado, será escrito no campo \"UTF=ANSI\" e será colocado um ponto de interrogação após o sinal de igual. Este ponto de interrogação deve ser substituído por algum caractere temporário que não esteja nas palavras, por exemplo, por dígitos diferentes (de 0 a 9). Estes caracteres temporários serão substituídos quando premir o botão \"REPL ClueArray ANSI->UTF\" e, se todas as substituições estiverem correctas, o algoritmo receberá uma lista de palavras \"Word\" da separador com palavras que utilizem uma dica. Para tal, clique num dos botões para permitir ou proibir dicas.",
            "help_str6": "\nNote que, para além do título, o registo tem mais dois campos: \"Síntese_de_discurso_de_idioma\" e \"Símbolos_para_botões\".\nNormalmente, estes campos estão vazios, pelo que o inglês é considerado, assim como todos os símbolos para botões. Se as suas palavras estiverem noutra língua, terá de introduzir uma linha no formato \"Etiqueta de idioma BCP 47\" no campo \"Síntese_de_discurso_de_idioma\". Por exemplo, para o alemão, é necessário escrever \"de-DE\" (sem aspas, claro). \nO campo \"Símbolos_para_botões\" pode ser deixado em branco, mas ainda assim, se o utilizar no AnkiDroid, a escrita será feita apenas através de botões, simplesmente para que as dicas do teclado não sejam utilizadas. de muitas palavras de uma só vez, por isso limite as suas palavras cruzadas a cerca de 20 palavras.",
            "help_str7": "\nSe tiver cartões de palavras em línguas estrangeiras com os campos: palavra, transcrição, tradução, exemplo e tradução do exemplo (a ordem dos campos não importa). Em seguida, pode selecionar estas entradas no programa Anki e exportá-las para um ficheiro (. txt). Exporte simplesmente como texto, sem todos os outros parâmetros. No separador com palavras, existe um botão com o qual pode adicionar palavras a partir de um ficheiro de texto. Se a ordem dos campos for diferente, terá de alterar o campo de texto (1=2=3=4=5) antes de adicionar (ou depois, mas limpe todo o campo e adicione-o novamente).",
            "help_str8": "\nQuando uma palavra tem um exemplo, pode criar uma lista de palavras com um exemplo (existe um botão separado para isso), mas como o exemplo não deve sugerir uma palavra, essa palavra é substituída por ***. Quando pronunciar uma palavra nas palavras cruzadas, o exemplo será pronunciado a seguir, uma vez que está na mesma língua da palavra.",

            "var z_lang_front00": "Palavras Cruzadas",
            "var z_lang_front01": "Lista de palavras",
            "var z_lang_front02": "Mostrar tudo",
            "var z_lang_front03": "Ocultar tudo",
            "var z_lang_front04": "Síntese vocal",
            "var z_lang_front05": "Mostrar apenas 1",
            "var z_lang_front1": "Ajuda",
            "var z_lang_front2": "Memorizamos 5 palavras até as podermos recordar facilmente (normalmente precisamos de percorrer estas palavras 3 vezes em círculo).",
            "var z_lang_front3": "Estas 5 palavras (linhas) estão separadas por uma linha.",
            "var z_lang_front4": "Antes de mostrar uma palavra (uma frase de palavras), precisamos de recordar visualmente cada letra (desenhando na nossa imaginação letra a letra que estamos a escrever ou a digitar no ecrã), lembrar como a palavra é pronunciada. Depois de a palavra ser vocalizada (se a \"Síntese vocal\" estiver ativada ao mostrar uma palavra ou frase), precisamos de dizer essa palavra a nós próprios mais duas ou três vezes.",
            "var z_lang_front5": "O botão \"Mostrar tudo\" foi concebido para mostrar todos os blocos (em []). É útil se precisar de recordar rapidamente e não necessitar de estudar.",
            "var z_lang_front6": "O botão \"Ocultar tudo\" foi concebido para esconder todos os blocos para depois avançar para o processo de memorização.",
            "var z_lang_front7": "Pode clicar no campo com a opção \"Mostrar apenas 1\" (ativada) e depois, antes de mostrar o bloco desejado, todos os outros serão ocultados. Isto ajuda a concentrar melhor num bloco e é útil, porque antes de abrir outro bloco, deve tentar lembrar-se do que está lá, e isto ajuda a memorizar.",
            "var z_lang_front8": "O campo com a caixa de verificação \"Síntese vocal\" pode ser desativado se não gostar da voz sintetizada (dependendo das definições do sistema).",
            "var z_lang_front9": "Esta funcionalidade de ocultar e abrir blocos permite organizar a ordem de memorização desejada: abrir uma palavra e lembrar a tradução ou vice-versa, abrir a tradução e lembrar a palavra.",
            "var z_lang_front10": "Não está limitado na sequência de memorização de palavras, mas ainda assim é aconselhável memorizar bem cerca de 5 palavras antes de passar para a memorização das outras 5.",
            "var z_lang_back1": "Estas palavras cruzadas interativas requerem JavaScript e um navegador web recente, incluindo Windows Internet Explorer, Mozilla Firefox, Google Chrome ou Apple Safari. Se desativou os scripts da página web, por favor reative-os e atualize a página. Se esta página web estiver guardada no seu computador, poderá precisar de clicar na barra de informação amarela no topo ou fundo da página para permitir o carregamento das palavras cruzadas.",
            "var z_lang_back2": "Parabéns!",
            "var z_lang_back3": "Completou estas palavras cruzadas",
            "var z_lang_back4": "Bem-vindo!",
            "var z_lang_back5": "Clique numa palavra no puzzle para começar.",
            "var z_lang_back6": "Resolver",
            "var z_lang_back7": "OK",
            "var z_lang_back8": "Cancelar",
            "var z_lang_back9": "Verificar puzzle",
            "var z_lang_back10": "Por favor aguarde enquanto as palavras cruzadas são carregadas...",
            "var z_lang_back11": "Horizontal, letras",
            "var z_lang_back12": "Vertical, letras",
            "var z_lang_back13": "A palavra que digitou contém caracteres inválidos. Por favor digite apenas letras na caixa acima.",
            "var z_lang_back14": "Não digitou letras suficientes. Total de letras nesta palavra",
            "var z_lang_back15": "Digitou demasiadas letras. Total de letras nesta palavra",
            "var z_lang_back16": "Erros",
            "var z_lang_back17": "Palavras incompletas",
            "var z_lang_back18": "Terminar",
            "var z_lang_back19" : "Palavras sugeridas"
        },
        "pt-BR": {
            "Unable_to_determine_active_field": "Não foi possível determinar o campo ativo.",
            "Invalid_field_index": "Índice de campo inválido.",  
            "Invalid_field_type": "O tipo de registro deve ser 'Crossword' ou conter 6 campos especificados.\nO cursor deve estar em um destes campos:",
            "WindowTitle": "Crossword for EclipseCrossword",
            "HelpText": "Aqui vai o texto de ajuda...",
            "Help": "Ajuda",
            "HelpTab": "Ajuda",
            "WordField": "Campo: 'word=transcription=translation=example=extranslation'",
            "OrderFields": "A ordem dos campos de inserção é:",
            "Clear": "Limpar",
            "AddFromTxt": "Adicionar do arquivo TXT e converter TAB para =",
            "CreateHint1": "Criar 'Word_hint' (palavra: tradução)",
            "CreateHint2": "Criar 'Word_hint' (palavra: exemplo)",
            "WordTab": "Palavras",
            "WordHintField": "Campo: 'Word_hint' (tipo de arquivo ewl)",
            "SaveEWL": "Salvar no arquivo *.ewl",
            "HintTab": "Palavra: Dica",
            "CrosswordCode": "Campo: 'Crossword_code'",
            "PasteHTML": "Colar do arquivo de palavras cruzadas *.html",
            "CodeTab": "Código de palavras cruzadas",
            "Warning": "Aviso",
            "NoContent": "Nenhum conteúdo para salvar no campo 'Word_hint'!",
            "SaveEWLFile": "Salvar arquivo de dicas",
            "Success": "Sucesso",
            "FileSaved": "Arquivo salvo com sucesso!",
            "Error": "Erro",
            "SaveError": "Falha ao salvar arquivo: ",
            "OpenHTMLFile": "Abrir arquivo HTML de palavras cruzadas",
            "InvalidFile": "Arquivo inválido",
            "NotCrosswordFile": "O arquivo selecionado não parece ser de palavras cruzadas (faltando 'CrosswordWidth =')",
            "InvalidFormat": "Formato inválido",
            "NoEndMarker": "Não foi possível encontrar o marcador de fim '//-->' no arquivo",
            "CodeImported": "Código de palavras cruzadas importado com sucesso!",
            "ReadError": "Falha ao ler arquivo: ",   
            "OpenTXTFile": "Abrir arquivo TXT exportado do Anki",
            "NotAnkiExport": "O arquivo selecionado não é uma exportação válida do Anki (faltando '#separator:tab' na primeira linha)",
            "HTMLWarning": "Aviso HTML",
            "HTMLNotAllowed": "HTML não é permitido no arquivo de exportação",
            "InvalidOrder": "Ordem inválida",
            "OrderFormatError": "A ordem dos campos deve ser números separados por '=' (ex. '1=2=3=4=5')",
            "ImportSuccess": "Importado do arquivo e linhas adicionadas: ",
            "ImportError": "Falha ao importar arquivo: ",
            "NoContentWordField": "Nenhum conteúdo no campo de palavra!",
            "NoValidLines": "Nenhuma linha válida encontrada para criar dicas",
            "SelectEncoding": "Selecionar codificação do arquivo",
            "ChooseEncoding": "Escolher codificação de texto:",
            "FileSavedEncoding": "Arquivo salvo com sucesso, codificação: ",
            "Save": "💾 Salvar",
            "FieldsUpdated": "Todos os campos foram atualizados com sucesso!",
            "SaveErrorField": "Falha ao salvar campos: ",
            "Close": "Fechar",
            "Saved": "Salvo",
            "Solution_hint": "Dica da solução",
            "No_solution_hint": "Sem dica da solução",
            "Clue_array_not_found": "Array Clue não encontrado no código!",
            "Failed_to_parse_Clue_array": "Falha ao analisar o array Clue!",
            "No_match_found_for_Clue_item": "Nenhuma correspondência encontrada para o item Clue",
           
            "help_str1": "Este complemento Anki foi desenvolvido para simplificar a construção de palavras cruzadas usando o programa gratuito https://www.eclipsecrossword.com/. O programa EclipseCrossword é exclusivo para Windows, mas você só precisa dele uma vez para gerar o código das palavras cruzadas.",
            "help_str2": "\nSe você tiver um jogo de palavras cruzadas EclipseCrossword pronto, salvo como HTML com JavaScript, poderá abrir imediatamente a última aba e usar o botão para inserir o código do arquivo. No final do código, há \"OnlyCheckOnce = false;\" - isso significa que você pode verificar as palavras das palavras cruzadas várias vezes, e não apenas uma. A linha \"Solve = false;\" indica que não haverá dicas. Você pode alterar \"Solve\" manualmente ou usando os botões.",
            "help_str3": "\nAs palavras cruzadas em si são mostradas no verso do cartão. E na frente do cartão, Palavras.\nA aba com palavras pode estar vazia se você não quiser sugerir nada, mas pode estar na forma de uma lista simples de palavras (ou sugestões).",
            "help_str4": "\nNa aba com palavras, você pode inserir não apenas palavras, mas uma tradução de palavras (dica, definição).\nAo escrever ==, você pula a transcrição, que não é necessária em palavras cruzadas comuns.\nVocê pode clicar no botão para criar dados para a terceira aba ou inseri-los você mesmo, já que o formato lá não é complicado:\npalavra: dica\n(observe que deve haver 2 espaços após os dois pontos).\nVocê pode misturar esta lista de palavras, limitá-la ao número necessário (recomenda-se não mais que 20) e, em seguida, classificá-la em ordem, se necessário.",
            "help_str5": "\nOs dados da lista de palavras podem ser salvos em um arquivo no formato \"*.ewl\" e abertos pelo programa EclipseCrossword para posterior geração de uma nova palavra cruzada, salvando-a como um arquivo \"*.html\" e a subsequente colagem do código das palavras cruzadas deste arquivo (o botão na última aba).\n\nO programa EclipseCrossword é muito antigo e ainda não suporta o formato UTF-8, portanto, salve na sua codificação. Se um caractere fora da codificação ANSI for encontrado, ele será escrito no campo \"UTF=ANSI\" e um ponto de interrogação será colocado após o sinal de igual. Este ponto de interrogação deve ser substituído por algum caractere temporário que não esteja nas palavras, por exemplo, por dígitos diferentes (de 0 a 9). Esses caracteres temporários serão substituídos quando você pressionar o botão \"REPL ClueArray ANSI->UTF\" e, se todas as substituições estiverem corretas, o algoritmo receberá uma lista de palavras \"Word\" da aba com palavras que usam uma dica. Para fazer isso, clique em um dos botões para permitir ou proibir dicas.",
            "help_str6": "\nObserve que, além do título, o registro possui mais dois campos: \"Síntese_de_discurso_de_idioma\" e \"Símbolos_para_botões\".\nNormalmente, esses campos estão vazios, então o inglês é considerado, assim como todos os símbolos para botões. Se suas palavras estiverem em outro idioma, você precisará inserir uma linha no formato \"Etiqueta de idioma BCP 47\" no campo \"Síntese_de_discurso_de_idioma\". Por exemplo, para alemão, você precisa escrever \"de-DE\" (sem aspas, é claro).\nO campo \"Símbolos_para_botões\" pode ser deixado em branco, mas ainda assim, se você usá-lo no AnkiDroid, a digitação será feita apenas por meio de botões, simplesmente para que as dicas do teclado não sejam usadas. Não é tão conveniente ler palavras cruzadas grandes no Android, e é difícil lembrar de muitas palavras de uma vez, então limite suas palavras cruzadas a cerca de 20 palavras.",
            "help_str7": "\nSe você tiver cartões de palavras em idiomas estrangeiros com os campos: palavra, transcrição, tradução, exemplo e tradução do exemplo (a ordem dos campos não importa). Em seguida, você pode selecionar essas entradas no programa Anki e exportá-las para um arquivo (.txt). Exporte simplesmente como texto, sem todos os outros parâmetros. Na aba com palavras, há um botão com o qual você pode adicionar palavras de um arquivo de texto. Se a ordem dos campos for diferente, você precisará alterar o campo de texto (1=2=3=4=5) antes de adicionar (ou depois, mas limpe todo o campo e adicione-o novamente).",
            "help_str8": "\nQuando uma palavra tem um exemplo, você pode criar uma lista de palavras com um exemplo (há um botão separado para isso), mas como o exemplo não deve sugerir uma palavra, essa palavra é substituída por ***. Quando você pronunciar uma palavra nas palavras cruzadas, o exemplo será pronunciado depois dela, pois está no mesmo idioma da palavra.",

            "var z_lang_front00": "Palavras Cruzadas",
            "var z_lang_front01": "Lista de palavras",
            "var z_lang_front02": "Mostrar tudo",
            "var z_lang_front03": "Ocultar tudo",
            "var z_lang_front04": "Síntese de voz",
            "var z_lang_front05": "Mostrar apenas 1",
            "var z_lang_front1": "Ajuda",
            "var z_lang_front2": "Memorizamos 5 palavras até conseguirmos lembrar facilmente (geralmente precisamos repetir essas palavras 3 vezes em um ciclo).",
            "var z_lang_front3": "Essas 5 palavras (linhas) são separadas por uma linha.",
            "var z_lang_front4": "Antes de mostrar uma palavra (uma frase), precisamos visualizar cada letra (imaginando letra por letra que estamos escrevendo ou digitando na tela), lembrar como a palavra é pronunciada. Depois que a palavra é vocalizada (se a \"Síntese de voz\" estiver ativada ao mostrar uma palavra ou frase), precisamos repetir essa palavra mentalmente mais duas ou três vezes.",
            "var z_lang_front5": "O botão \"Mostrar tudo\" serve para exibir todos os blocos (em []). É útil quando você precisa lembrar rapidamente sem precisar estudar.",
            "var z_lang_front6": "O botão \"Ocultar tudo\" serve para esconder todos os blocos e então iniciar o processo de memorização.",
            "var z_lang_front7": "Você pode clicar no campo com a opção \"Mostrar apenas 1\" (ativada) e então, antes de mostrar o bloco desejado, todos os outros serão ocultados. Isso ajuda a se concentrar melhor em um bloco e é útil porque, antes de abrir outro bloco, você deve tentar lembrar o que está lá, o que ajuda na memorização.",
            "var z_lang_front8": "O campo com a caixa de seleção \"Síntese de voz\" pode ser desativado se você não gostar da voz sintetizada (dependendo das configurações do sistema).",
            "var z_lang_front9": "Esta funcionalidade de ocultar e abrir blocos permite organizar a ordem de memorização: abrir uma palavra e lembrar a tradução ou vice-versa, abrir a tradução e lembrar a palavra.",
            "var z_lang_front10": "Você não está limitado na sequência de memorização, mas ainda assim é recomendável memorizar bem cerca de 5 palavras antes de passar para as próximas 5.",
            "var z_lang_back1": "Este jogo de palavras cruzadas interativo requer JavaScript e um navegador atualizado, como Windows Internet Explorer, Mozilla Firefox, Google Chrome ou Apple Safari. Se você desativou os scripts da página, por favor ative-os novamente e atualize a página. Se esta página estiver salva no seu computador, talvez precise clicar na barra amarela de informações no topo ou rodapé da página para carregar o jogo.",
            "var z_lang_back2": "Parabéns!",
            "var z_lang_back3": "Você completou estas palavras cruzadas",
            "var z_lang_back4": "Bem-vindo!",
            "var z_lang_back5": "Clique em uma palavra no jogo para começar.",
            "var z_lang_back6": "Resolver",
            "var z_lang_back7": "OK",
            "var z_lang_back8": "Cancelar",
            "var z_lang_back9": "Verificar palavras cruzadas",
            "var z_lang_back10": "Por favor, aguarde enquanto as palavras cruzadas são carregadas...",
            "var z_lang_back11": "Horizontal, letras",
            "var z_lang_back12": "Vertical, letras",
            "var z_lang_back13": "A palavra que você digitou contém caracteres inválidos. Digite apenas letras na caixa acima.",
            "var z_lang_back14": "Você não digitou letras suficientes. Total de letras nesta palavra",
            "var z_lang_back15": "Você digitou letras demais. Total de letras nesta palavra",
            "var z_lang_back16": "Erros",
            "var z_lang_back17": "Palavras incompletas",
            "var z_lang_back18": "Finalizar",
            "var z_lang_back19" : "Palavras sugeridas"
        }
    }
}